<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="im" type="Parameter" version="opset1">
			<data shape="2,3,512,512" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="im">
					<dim>2</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="__module.encoder/aten::expand/Broadcast_29_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 1, 192" offset="0" size="768" />
			<output>
				<port id="0" precision="FP16" names="217,cls_tokens">
					<dim>2</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="__module.encoder/aten::expand/Broadcast_29" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.encoder.patch_embed.proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 3, 16, 16" offset="768" size="294912" />
			<output>
				<port id="0" precision="FP16" names="206,self.encoder.patch_embed.proj.weight">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="self.encoder.patch_embed.proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.encoder.patch_embed.proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="16, 16" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.encoder.patch_embed.proj/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1, 1" offset="295680" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.encoder.patch_embed.proj/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.encoder.patch_embed.proj/aten::_convolution/Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="213">
					<dim>2</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.encoder.patch_embed/aten::flatten/Concat" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="296064" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.encoder.patch_embed/aten::flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="214">
					<dim>2</dim>
					<dim>192</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.encoder.patch_embed/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="296076" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.encoder.patch_embed/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>192</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="215,x.1">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.encoder/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="219,x.3">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.encoder/aten::add/Multiply_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1025, 192" offset="296088" size="393600" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.encoder/aten::add/Multiply" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.encoder/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="220,input.1">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.encoder.blocks.0.norm1/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="689688" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.encoder.blocks.0.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_15049_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="689692" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_15049" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.encoder.blocks.0.norm1/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_15050_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="690076" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_15050" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.encoder.blocks.0.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="221,x.5">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="self.encoder.blocks.0.attn.qkv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="576, 192" offset="690460" size="221184" />
			<output>
				<port id="0" precision="FP16" names="202,self.encoder.blocks.0.attn.qkv.weight">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="self.encoder.blocks.0.attn.qkv.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.encoder.blocks.0.attn.qkv/aten::linear/MatMul_39" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_15051_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 576" offset="911644" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_15051" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.encoder.blocks.0.attn.qkv/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="226">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.encoder.blocks.0.attn/prim::ListConstruct_40/Concat" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="912796" size="20" />
			<output>
				<port id="0" precision="I32" names="229">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.encoder.blocks.0.attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="230">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="9" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="912816" size="20" />
			<output>
				<port id="0" precision="I32" names="9">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.encoder.blocks.0.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="231,qkv.1">
					<dim>3</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="14" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="912836" size="4" />
			<output>
				<port id="0" precision="I32" names="14" />
			</output>
		</layer>
		<layer id="36" name="__module.encoder.blocks.0.attn/aten::select/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="232,q.1">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="16" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="912840" size="4" />
			<output>
				<port id="0" precision="I32" names="16" />
			</output>
		</layer>
		<layer id="38" name="__module.encoder.blocks.0.attn/aten::select/Gather_41" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="233,k.1">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_15052_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="912844" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_15052" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Multiply_14803" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.encoder.blocks.0.attn/aten::mul/Multiply" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="237,attn.1">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>1025</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.encoder.blocks.0.attn/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>1025</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="238,input.5">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>1025</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="26" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="912846" size="4" />
			<output>
				<port id="0" precision="I32" names="26" />
			</output>
		</layer>
		<layer id="45" name="__module.encoder.blocks.0.attn/aten::select/Gather_42" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="234,v.1">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.encoder.blocks.0.attn/aten::matmul/MatMul_52" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>1025</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="239">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.encoder.blocks.0.attn/aten::transpose/ScatterElementsUpdate_71" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="912850" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.encoder.blocks.0.attn/aten::transpose/Transpose_72" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="240">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.encoder.blocks.0.attn/prim::ListConstruct_75/Concat" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="912866" size="12" />
			<output>
				<port id="0" precision="I32" names="241">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.encoder.blocks.0.attn/aten::reshape/Reshape_76" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="242,input.7">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="self.encoder.blocks.0.attn.proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 192" offset="912878" size="73728" />
			<output>
				<port id="0" precision="FP16" names="200,self.encoder.blocks.0.attn.proj.weight">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="self.encoder.blocks.0.attn.proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.encoder.blocks.0.attn.proj/aten::linear/MatMul_77" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_15053_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="986606" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_15053" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.encoder.blocks.0.attn.proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="243,input.9">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.encoder.blocks.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="244,input.11">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.encoder.blocks.0.norm2/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="689688" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.encoder.blocks.0.norm2/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_15054_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="986990" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_15054" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.encoder.blocks.0.norm2/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_15055_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="987374" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_15055" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.encoder.blocks.0.norm2/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="245,input.13">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="self.encoder.blocks.0.mlp.fc1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 192" offset="987758" size="294912" />
			<output>
				<port id="0" precision="FP16" names="196,self.encoder.blocks.0.mlp.fc1.weight">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="self.encoder.blocks.0.mlp.fc1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.encoder.blocks.0.mlp.fc1/aten::linear/MatMul_78" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_15056_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="1282670" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_15056" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.encoder.blocks.0.mlp.fc1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="246,input.15">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.encoder.blocks.0.mlp.act/aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="247,input.17">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="self.encoder.blocks.0.mlp.fc2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 768" offset="1284206" size="294912" />
			<output>
				<port id="0" precision="FP16" names="194,self.encoder.blocks.0.mlp.fc2.weight">
					<dim>192</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="self.encoder.blocks.0.mlp.fc2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.encoder.blocks.0.mlp.fc2/aten::linear/MatMul_79" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_15057_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="1579118" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_15057" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.encoder.blocks.0.mlp.fc2/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="248,input.21">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.encoder.blocks.0/aten::add/Add_82" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="249,input.23">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.encoder.blocks.1.norm1/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="689688" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.encoder.blocks.1.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_15058_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="1579502" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_15058" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.encoder.blocks.1.norm1/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_15059_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 192" offset="1579886" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_15059" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.encoder.blocks.1.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="250,x.7">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="self.encoder.blocks.1.attn.qkv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="576, 192" offset="1580270" size="221184" />
			<output>
				<port id="0" precision="FP16" names="190,self.encoder.blocks.1.attn.qkv.weight">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="self.encoder.blocks.1.attn.qkv.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.encoder.blocks.1.attn.qkv/aten::linear/MatMul_89" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>576</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_15060_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 576" offset="1801454" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_15060" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.encoder.blocks.1.attn.qkv/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="255">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.encoder.blocks.1.attn/aten::size/ShapeOf_86" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_12863" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="1802606" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_12864" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1802614" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="97" name="Gather_12865" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.encoder.blocks.1.attn/prim::ListConstruct_90/Reshape_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="1802622" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.encoder.blocks.1.attn/prim::ListConstruct_90/Reshape_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="1802622" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.encoder.blocks.1.attn/aten::size/Constant_87" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="912836" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="101" name="__module.encoder.blocks.1.attn/aten::size/Gather_88" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="253" />
			</output>
		</layer>
		<layer id="102" name="20" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1802622" size="4" />
			<output>
				<port id="0" precision="I32" names="20" />
			</output>
		</layer>
		<layer id="103" name="__module.encoder.blocks.1.attn/aten::floor_divide/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="104" name="__module.encoder.blocks.1.attn/aten::floor_divide/Floor" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="I32" names="256,257" />
			</output>
		</layer>
		<layer id="105" name="Constant_6197" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1802626" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.encoder.blocks.1.attn/prim::ListConstruct_90/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.encoder.blocks.1.attn/prim::ListConstruct_90/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="258">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.encoder.blocks.1.attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="259">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.encoder.blocks.1.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1025</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="260,qkv.3">
					<dim>3</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.encoder.blocks.1.attn/aten::select/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="261,q.3">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.encoder.blocks.1.attn/aten::select/Gather_91" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="262,k.3">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_15061_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="1802634" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_15061" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Multiply_14805" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.encoder.blocks.1.attn/aten::mul/Multiply" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="266,attn.5">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>1025</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.encoder.blocks.1.attn/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>1025</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="267,input.25">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>1025</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.encoder.blocks.1.attn/aten::select/Gather_92" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="263,v.3">
